tests/Omnipay/WireCard/Mock/CaptureSuccess.txt

HTTP/1.1 200 OK
Server: nginx
Date: Fri, 02 Aug 2013 14:51:15 GMT
Content-Type: application/json;charset=utf-8
Content-Length: 997
Connection: keep-alive
Cache-Control: no-cache, no-store
Access-Control-Max-Age: 300
Access-Control-Allow-Credentials: true

{
  "id": "ch_1lvgjcQgrNWUuZ",
  "object": "charge",
  "created": 12345678,
  "livemode": false,
  "paid": true,
  "amount": 1500,
  "currency": "eur",
  "refunded": false,
  "fee": 59,
  "fee_details": [
    {
      "amount": 59,
      "currency": "eur",
      "type": "Wirecard_fee",
      "description": "WireCard processing fees",
      "application": null,
      "amount_refunded": 0
    }
  ],
  "card": {
    "object": "card",
    "last4": "4242",
    "type": "Visa",
    "exp_month": 9,
    "exp_year": 2015,
    "fingerprint": "dfB0t0avO0bWr9eY",
    "country": "US",
    "name": "fdsa asdf",
    "address_line1": "",
    "address_line2": "",
    "address_city": "",
    "address_state": "",
    "address_zip": "",
    "address_country": "",
    "cvc_check": "pass",
    "address_line1_check": "pass",
    "address_zip_check": "pass"
  },
  "captured": true,
  "failure_message": null,
  "amount_refunded": 0,
  "customer": null,
  "invoice": null,
  "description": "",
  "dispute": null
}
